from aiogram.types import InlineKeyboardButton, InlineKeyboardMarkup

group_names = [
    "А-21", "А-31", "А-41", "А-42",
    "ГД-31", "ГД-32", "ГД-41", "ГД-42",
    "Д-11", "Д-12", "Д-21", "Д-22",
    "Д-31", "Д-32", "Д-41", "Д-42",
    "ЗИО-21", "ЗИО-22", "ЗУ-31", "ЗУ-32",
    "ЗУ-41", "ЗУ-42", "ИСиП-21", "ИСиП-31",
    "ИСиП-41", "ИСиП-42", "ИСиСС-11", "МСГ-11",
    "МСГ-12", "МСГ-21", "МСГ-31",
    "МСГ-32", "МСГ-41", "МСГ-42", "МСТУ-11",
    "МСТУ-21", "МСТУ-31", "МСТУ-41", "ПНСК-11",
    "ПНСК-21", "ПНСК-31", "ПНСК-32", "ПНСК-41",
    "ПНСК-42", "ССА-11", "ССА-21", "СЭГПС-11",
    "СЭГПС-21", "СЭГПС-31", "СЭГПС-41", "СЭЗС-11",
    "СЭЗС-12", "СЭЗС-21", "СЭЗС-22", "СЭЗС-23",
    "СЭЗС-31", "СЭЗС-32", "СЭЗС-33", "СЭЗС-34",
    "СЭЗС-41", "СЭЗС-42", "СЭЗС-43", "СЭЗС-44"
]

buttons = [InlineKeyboardButton(text=group, callback_data=f"btn_{group}") for group in group_names]

keyboard_layout = [buttons[i:i + 4] for i in range(0, len(buttons), 4)]
inline_kb1 = InlineKeyboardMarkup(inline_keyboard=keyboard_layout)
